#ifndef __MERIDIAN_SERVO_DYNAMIXEL_H__
#define __MERIDIAN_SERVO_DYNAMIXEL_H__

#include "main.h"
#include "config.h"

//================================================================================================================
//  DYNOMIXELサーボ関連の処理  ---------------------------------------------------------------------------------------
//================================================================================================================

/// @brief スタブ関数.
/// @return 常にfalseを返す.
bool mrd_servo_dxl20_x()
{
    return false;
}

#endif // __MERIDIAN_SERVO_DYNAMIXEL_H__
